xueliu/nRF52/nrf5_iot_sdk_3288530/examples/iot/lwm2m/lwm2m_client/main.c
/* Copyright (c) 2015 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 *
 * @defgroup ble_sdk_app_lwm2m_client_main main.c
 * @{
 * @ingroup ble_sdk_lwm2m_client
 * @brief LWM2M client main file.
 *
 */

#include <stdbool.h>
#include <stdint.h>
#include "boards.h"
#include "nordic_common.h"
#include "nrf_delay.h"
#include "softdevice_handler.h"
#include "sdk_config.h"
#include "mem_manager.h"
#include "app_trace.h"
#include "app_button.h"
#include "app_timer_appsh.h"
#include "ble_advdata.h"
#include "ble_srv_common.h"
#include "ble_ipsp.h"
#include "iot_common.h"
#include "ipv6_api.h"
#include "icmp6_api.h"
#include "udp_api.h"
#include "iot_timer.h"
#include "coap_api.h"
#include "coap_option.h"
#include "lwm2m_api.h"
#include "lwm2m_objects_tlv.h"
#include "ipso_objects_tlv.h"
#include "addr_parse.h"
#include "ipv6_medium.h"

#define USE_SECURITY 1

#if (USE_SECURITY == 1)
#define BOOTSTRAP_LOCAL_PORT            5684                                                  /**< Port to be used as local port for bootstrapping. */
#define SERVER_LOCAL_PORT               BOOTSTRAP_LOCAL_PORT                                  /**< Port to be used as local port for server registration. */
#else
#define BOOTSTRAP_LOCAL_PORT            5683                                                  /**< Port to be used as local port for bootstrapping. */
#define SERVER_LOCAL_PORT               BOOTSTRAP_LOCAL_PORT                                  /**< Port to be used as local port for server registration. */
#endif

#if (USE_SECURITY == 1)
#define BOOTSTRAP_URI  "coaps://[2001:db8::1]:5684"                                           /**< Server URI to the bootstrap server when using security (DTLS). */ 
#else
#define BOOTSTRAP_URI  "coap://[2001:db8::1]:5683"                                            /**< Server URI to the bootstrap server when not used with security (DTLS). */ 
#endif

#define LWM2M_SERVERS_TOTAL_NUM         2                                                     /**< Total number of LWM2M servers including BS server. */

#define CLIENT_UUID                     "0a18de70-0ce0-4570-bce9-7f5895db6c70"                /**< UUID of the device. */

#define LED_ONE                         BSP_LED_0_MASK
#define LED_TWO                         BSP_LED_1_MASK
#define LED_THREE                       BSP_LED_2_MASK
#define LED_FOUR                        BSP_LED_3_MASK
#define ALL_APP_LED                    (BSP_LED_0_MASK | BSP_LED_1_MASK | \
                                        BSP_LED_2_MASK | BSP_LED_3_MASK)                      /**< Define used for simultaneous operation of all application LEDs. */

#define IPSO_LED                        LED_FOUR

#define BUTTON_ONE                      BSP_BUTTON_0
#define BUTTON_TWO                      BSP_BUTTON_1
#define BUTTON_THREE                    BSP_BUTTON_2
#ifdef COMMISSIONING_ENABLED
#define ERASE_BUTTON_PIN_NO             BSP_BUTTON_3                                          /**< Button used to erase commissioning settings. */
#endif // COMMISSIONING_ENABLED

#define APP_TIMER_OP_QUEUE_SIZE         8                                                     /**< Size of timer operation queues. */

#define BUTTON_DETECTION_DELAY          APP_TIMER_TICKS(50, APP_TIMER_PRESCALER)

#define LED_BLINK_INTERVAL_MS           300                                                   /**< LED blinking interval. */
#define COAP_TICK_INTERVAL_MS           1000                                                  /**< Interval between periodic callbacks to CoAP module. */
#define LWM2M_TICK_INTERVAL_MS          3000                                                  /**< Interval between periodic bootstrap or server registration attempts. */

#define LWM2M_RETRY_COUNT_MAX           5                                                     /**< Max number of bootstrap attempts. */
#define SECURITY_SERVER_URI_SIZE_MAX    32                                                    /**< Max size of server uris. */

#define BOOTSTRAP_SECURITY_INSTANCE_IDX 0                                                     /**< Index of bootstrap security instance. */
#define SERVER_SECURITY_INSTANCE_IDX    1                                                     /**< Index of server security instance. */
#define APP_RTR_SOLICITATION_DELAY      500                                                   /**< Time before host sends an initial solicitation in ms. */

#define DEAD_BEEF                       0xDEADBEEF                                            /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */
#define MAX_LENGTH_FILENAME             128                                                   /**< Max length of filename to copy for the debug error handler. */

#define APP_ENABLE_LOGS                 1                                                     /**< Disable debug trace in the application. */

#if (APP_ENABLE_LOGS == 1)

#define APPL_LOG  app_trace_log
#define APPL_DUMP app_trace_dump

#else // APP_ENABLE_LOGS

#define APPL_LOG(...)
#define APPL_DUMP(...)

#endif // APP_ENABLE_LOGS

#define APPL_ADDR(addr) APPL_LOG("%02x%02x:%02x%02x:%02x%02x:%02x%02x:%02x%02x:%02x%02x:%02x%02x:%02x%02x\r\n", \
                                (addr).u8[0],(addr).u8[1],(addr).u8[2],(addr).u8[3],                            \
                                (addr).u8[4],(addr).u8[5],(addr).u8[6],(addr).u8[7],                            \
                                (addr).u8[8],(addr).u8[9],(addr).u8[10],(addr).u8[11],                          \
                                (addr).u8[12],(addr).u8[13],(addr).u8[14],(addr).u8[15])

