xueliu/nRF52/nrf5_iot_sdk_3288530/examples/iot/lwm2m/lwm2m_client/main.c
typedef enum
{
    LEDS_INACTIVE = 0,
    LEDS_CONNECTABLE_MODE,
    LEDS_IPV6_IF_DOWN,
    LEDS_IPV6_IF_UP,
} display_state_t;

static ble_gap_addr_t                      m_local_ble_addr;                                  /**< Local BLE address. */
static ble_gap_adv_params_t                m_adv_params;                                      /**< Parameters to be passed to the stack when starting advertising. */
static ipv6_medium_instance_t              m_ipv6_medium;
eui64_t                                    eui64_local_iid;                                   /**< Local EUI64 value that is used as the IID for*/

static const ipv6_addr_t      local_routers_multicast_addr = {{
        0xFF, 0x02, 0x00, 0x00, \
        0x00, 0x00, 0x00, 0x00, \
        0x00, 0x00, 0x00, 0x00, \
        0x00, 0x00, 0x00, 0x02
    }
};                                                                                            /**< Multicast address of all routers on the local network segment. */

APP_TIMER_DEF(m_iot_timer_tick_src_id);                                                       /**< App timer instance used to update the IoT timer wall clock. */

static char m_security_server_uri[2][SECURITY_SERVER_URI_SIZE_MAX] = {BOOTSTRAP_URI, ""};

static lwm2m_remote_t                      m_bootstrap_remote;                                /**< Remote structure for bootstrap server. */
static lwm2m_remote_t                      m_server_remote;                                   /**< Remote structure for server. */
static lwm2m_server_config_t               m_server_conf;                                     /**< Server configuration structure. */
static lwm2m_client_identity_t             m_client_id;                                       /**< Client ID structure to hold the client's UUID. */
static bool                                m_use_dtls[2]            = {false, false};         /**< Array to keep track of which of the connections to bootstrap server and server is using a secure link. */
static display_state_t                     m_display_state          = LEDS_INACTIVE;          /**< Board LED display state. */
static bool                                m_bootstrapped           = false;                  /**< Variable holding the state of whether the devices is completed boostrapping or not. */
static bool                                m_bootstrap_retry        = false;                  /**< Variable holding the state of whether the devices is should retry bootstrapping. */
static bool                                m_register_retry         = false;                  /**< Variable holding the state of whether the devices is should retry registration with the server. */
static uint8_t                             m_bootstrap_retry_count  = 0;                      /**< Variable holding the number of attempts to try to bootstrap before giving up. */
static uint8_t                             m_register_retry_count   = 0;                      /**< Variable holding the number of attempts to try register to the server before giving up. */
static uint8_t *                           mp_link_format_string    = NULL;                   /**< Pointer to hold a link format string across a button press initiated registration and retry. */
static uint32_t                            m_link_format_string_len = 0;                      /**< Lenght of the link format string that is used in registration attempts. */

// Objects
static lwm2m_object_prototype_t            m_object_security;                                 /**< LWM2M security base object. */
static lwm2m_object_prototype_t            m_object_server;                                   /**< LWM2M server base object. */
static lwm2m_object_prototype_t            m_object_digital_out;                              /**< IPSO digital output base object. */
static lwm2m_object_prototype_t            m_bootstrap_server;                                /**< Named object to be used as callback object when bootstrap is completed. */

static char m_bootstrap_object_alias_name[] = "bs";                                           /**< Name of the bootstrap complete object. */

// Instances
static lwm2m_server_t                      m_instance_server;                                 /**< Server object instance to be filled by the bootstrap server. */
static lwm2m_security_t                    m_instance_security[2];                            /**< Security object instances. Index 0 is always bootstrap instance. */
static ipso_digital_output_t               m_instance_digital_out;                            /**< IPSO digital output object instance. */
static char                                m_ipso_digital_output_led4_app_type[] = "LED4";    /**< Application type string to be used by the IPSO digital output instance. */

#ifdef COMMISSIONING_ENABLED
static bool                                m_power_off_on_failure = false;
static bool                                m_identity_mode_active;
#endif // COMMISSIONING_ENABLED

/**@brief Function for error handling, which is called when an error has occurred.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of error.
 *
 * @param[in] error_code  Error code supplied to the handler.
 * @param[in] line_num    Line number where the handler is called.
 * @param[in] p_file_name Pointer to the file name.
 */
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    LEDS_ON(ALL_APP_LED);
    APPL_LOG("[** ASSERT **]: Error 0x%08lX, Line %ld, File %s\r\n", \
             error_code, line_num, p_file_name);

    // Variables used to retain function parameter values when debugging.
    static volatile uint8_t  s_file_name[MAX_LENGTH_FILENAME];
    static volatile uint16_t s_line_num;
    static volatile uint32_t s_error_code;

    strncpy((char *)s_file_name, (const char *)p_file_name, MAX_LENGTH_FILENAME - 1);
    s_file_name[MAX_LENGTH_FILENAME - 1] = '\0';
    s_line_num                           = line_num;
    s_error_code                         = error_code;
    UNUSED_VARIABLE(s_file_name);
    UNUSED_VARIABLE(s_line_num);
    UNUSED_VARIABLE(s_error_code);

