xueliu/nRF52/nrf5_iot_sdk_3288530/examples/iot/lwm2m/lwm2m_client/main.c
    // The list of IoT Timer clients is declared as a constant.
    static const iot_timer_clients_list_t iot_timer_clients =
    {
        (sizeof(list_of_clients) / sizeof(iot_timer_client_t)),
        &(list_of_clients[0]),
    };

    // Passing the list of clients to the IoT Timer module.
    err_code = iot_timer_client_list_set(&iot_timer_clients);
    APP_ERROR_CHECK(err_code);

    // Starting the app timer instance that is the tick source for the IoT Timer.
    err_code = app_timer_start(m_iot_timer_tick_src_id, 
                               APP_TIMER_TICKS(IOT_TIMER_RESOLUTION_IN_MS, APP_TIMER_PRESCALER), 
                               NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling interface events from the IP stack. */
static void ip_app_handler(iot_interface_t * p_interface, ipv6_event_t * p_event)
{
    uint32_t    err_code;
    ipv6_addr_t src_addr;

    APPL_LOG("[APPL]: Got IP Application Handler Event on interface 0x%p\r\n", p_interface);

    switch (p_event->event_id)
    {
    case IPV6_EVT_INTERFACE_ADD:
#ifdef COMMISSIONING_ENABLED
        commissioning_joining_mode_timer_ctrl(JOINING_MODE_TIMER_STOP_RESET);
#endif // COMMISSIONING_ENABLED

        APPL_LOG("[APPL]: New interface added!\r\n");
        m_display_state = LEDS_IPV6_IF_UP;

        APPL_LOG("[APPL]: Sending Router Solicitation to all routers!\r\n");

        // Create Link Local addresses
        IPV6_CREATE_LINK_LOCAL_FROM_EUI64(&src_addr, p_interface->local_addr.identifier);

        // Delay first solicitation due to possible restriction on other side.
        nrf_delay_ms(APP_RTR_SOLICITATION_DELAY);

        // Send Router Solicitation to all routers.
        err_code = icmp6_rs_send(p_interface,
                                 &src_addr,
                                 &local_routers_multicast_addr);
        APP_ERROR_CHECK(err_code);
        break;

    case IPV6_EVT_INTERFACE_DELETE:
#ifdef COMMISSIONING_ENABLED
            commissioning_joining_mode_timer_ctrl(JOINING_MODE_TIMER_START);
#endif // COMMISSIONING_ENABLED

        APPL_LOG("[APPL]: Interface removed!\r\n");
        m_display_state = LEDS_IPV6_IF_DOWN;
        break;

    default:
        //Unknown event. Should not happen.
        break;
    }
}


/**@brief Function for initializing IP stack.
 *
 * @details Initialize the IP Stack.
 */
static void ip_stack_init(void)
{
    uint32_t    err_code;
    ipv6_init_t init_param;

    err_code = ipv6_medium_eui64_get(m_ipv6_medium.ipv6_medium_instance_id, \
                                     &eui64_local_iid);
    APP_ERROR_CHECK(err_code);

    init_param.p_eui64       = &eui64_local_iid;
    init_param.event_handler = ip_app_handler;

    err_code = ipv6_init(&init_param);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Application implementation of the root handler interface. 
 * 
 * @details This function is not bound to any object or instance. It will be called from 
 *          LWM2M upon an action on the root "/" URI path. During bootstrap it is expected 
 *          to get a DELETE operation on this URI. 
 */
uint32_t lwm2m_coap_handler_root(uint8_t op_code, coap_message_t * p_request)
{
    (void)lwm2m_respond_with_code(COAP_CODE_202_DELETED, p_request);
    
    // Delete any existing objects or instances if needed.
    
    return NRF_SUCCESS;
}


/**@brief LWM2M notification handler. */
uint32_t lwm2m_notification(lwm2m_notification_type_t type, 
                            lwm2m_remote_t *          p_remote, 
                            uint8_t                   coap_code)
{
    APPL_LOG("[APPL]: Got LWM2M notifcation %d \r\n", type);
    
    if (type == LWM2M_NOTIFCATION_TYPE_REGISTER)
    {
        // We have successfully registered, free up the allocated link format string. 
        if (mp_link_format_string != NULL)
        {
            // No more attempts, clean up. 
            nrf_free(mp_link_format_string);
            mp_link_format_string = NULL;
        }
    }
    
    return NRF_SUCCESS;
}


/**@brief Callback function for the named bootstrap complete object. */
uint32_t bootstrap_object_callback(lwm2m_object_prototype_t * p_object,
                                   uint16_t                   instance_id,
                                   uint8_t                    op_code,
                                   coap_message_t *           p_request)
{
    m_bootstrapped = true;
    LEDS_ON(LED_THREE);

    (void)lwm2m_respond_with_code(COAP_CODE_201_CREATED, p_request);

    return NRF_SUCCESS;
}


/**@brief Callback function for IPSO digital output instances. */
uint32_t ipso_instance_callback(lwm2m_instance_prototype_t * p_instance, 
                                uint16_t                     resource_id, 
                                uint8_t                      op_code, 
                                coap_message_t *             p_request)
{
    ipso_digital_output_t * ipso_dig_out = (ipso_digital_output_t *)p_instance;
    
    APPL_LOG("[APPL]: lwm2m: ipso_instance_callback, instance: %u, resource id: %u\r\n", 
             p_instance->instance_id, 
             resource_id);
    
    switch (resource_id)
    {
        case IPSO_RR_ID_DIGITAL_OUTPUT_STATE:
        {
            switch (op_code)
            {
                case LWM2M_OPERATION_CODE_READ:
                {
                    uint8_t dig_out_state = ipso_dig_out->digital_output_state + '0'; // Convert to ascii
                    (void)lwm2m_respond_with_payload(&dig_out_state, 1,  p_request);
                    break;
                }
            
                case LWM2M_OPERATION_CODE_WRITE:
                {
                    bool dig_out_state = (bool)(p_request->p_payload[0] - '0');
                    ipso_dig_out->digital_output_state = dig_out_state;
                    
                    if (ipso_dig_out->digital_output_state == true)
                    {
                        if (ipso_dig_out->digital_output_polarity == (bool)IPSO_RR_ID_DIGITAL_OUTPUT_POLARITY_NORMAL)
                        {
                            LEDS_ON(IPSO_LED);
                        }
                        else 
                        {
                            LEDS_OFF(IPSO_LED);
                        }
                    }
                    else
                    {
                        if (ipso_dig_out->digital_output_polarity == (bool)IPSO_RR_ID_DIGITAL_OUTPUT_POLARITY_NORMAL)
                        {
                            LEDS_OFF(IPSO_LED);
                        }
                        else
                        {
                            LEDS_ON(IPSO_LED);
                        }
                    }
                    
                    (void)lwm2m_respond_with_code(COAP_CODE_204_CHANGED, p_request);
                    break;
                }
                
                default:
                {
                    (void)lwm2m_respond_with_code(COAP_CODE_405_METHOD_NOT_ALLOWED, p_request);
                    break;
                }
            }
            break;
        }
        
        case IPSO_RR_ID_DIGITAL_OUTPUT_POLARITY:
        {
            switch (op_code)
            {
                case LWM2M_OPERATION_CODE_READ:
                {
                    uint8_t dig_out_polarity = ipso_dig_out->digital_output_polarity + '0'; // Convert to ascii
                    (void)lwm2m_respond_with_payload(&dig_out_polarity, 1,  p_request);
                    break;
                }
            
                case LWM2M_OPERATION_CODE_WRITE:
                {
                    bool dig_out_polarity = (bool)(p_request->p_payload[0] - '0');
                    ipso_dig_out->digital_output_polarity = dig_out_polarity;                   
                   (void)lwm2m_respond_with_code(COAP_CODE_204_CHANGED, p_request);
                    break;
                }
                
                default:
                    break;
            }
            
            break;
        }            
        
        case IPSO_RR_ID_APPLICATION_TYPE:
        {
            switch (op_code)
            {
                case LWM2M_OPERATION_CODE_READ:
                {
                   (void)lwm2m_respond_with_payload((uint8_t *)ipso_dig_out->application_type.p_val, 
                                                    ipso_dig_out->application_type.len,  
                                                    p_request);
                    break;
                }
                
                case LWM2M_OPERATION_CODE_WRITE:
                {
                    (void)lwm2m_respond_with_code(COAP_CODE_405_METHOD_NOT_ALLOWED, p_request);
                    break;
                }
                    
                default:
                    break;
            }
            
            break;
        }         
        
        case LWM2M_INVALID_RESOURCE:
        {
            // This is a callback to the instance, not a specific resource.
            switch (op_code)
            {
                case LWM2M_OPERATION_CODE_READ:
                {
                    uint8_t  buffer[100];
                    uint32_t buffer_size = sizeof(buffer);

                    (void)ipso_tlv_ipso_digital_output_encode(buffer, &buffer_size, ipso_dig_out);
                    
