xueliu/nRF52/nrf5_iot_sdk_3288530/examples/iot/lwm2m/lwm2m_client/main.c
                    (void)lwm2m_respond_with_payload(buffer, 
                                                     buffer_size,  
                                                     p_request);
                    break;
                }
                
                case LWM2M_OPERATION_CODE_WRITE:
                {
                    (void)ipso_tlv_ipso_digital_output_decode(ipso_dig_out, 
                                                              p_request->p_payload, 
                                                              p_request->payload_len);
                   
                    // As decode will overwrite the lwm2m_string_t we need to set it manually.
                    // strlen to not count the 0-terminator.
                    uint8_t str_size = strlen(m_ipso_digital_output_led4_app_type); 
                    if (ipso_dig_out->application_type.len < str_size)
                    {
                        str_size = ipso_dig_out->application_type.len;
                    }
                    
                    memset(m_ipso_digital_output_led4_app_type, 0, sizeof(m_ipso_digital_output_led4_app_type));
                    memcpy(m_ipso_digital_output_led4_app_type, 
                           ipso_dig_out->application_type.p_val, 
                           str_size);
                    
                    // Point to the static buffer again.
                    ipso_dig_out->application_type.p_val = m_ipso_digital_output_led4_app_type;
                    ipso_dig_out->application_type.len   = str_size;
                    
                   (void)lwm2m_respond_with_code(COAP_CODE_204_CHANGED, p_request);
                    break;
                }
                
                default:
                    break;
                
            }
            
            break;
        }
        
        default:
        {
            (void)lwm2m_respond_with_code(COAP_CODE_501_NOT_IMPLEMENTED, p_request);
            break;
        }
    }

    return NRF_SUCCESS;
}


/**@brief Callback function for LWM2M server instances. */
uint32_t server_instance_callback(lwm2m_instance_prototype_t * p_instance, 
                                  uint16_t                     resource_id, 
                                  uint8_t                      op_code, 
                                  coap_message_t *             p_request)
{
    APPL_LOG("[APPL]: lwm2m: server_instance_callback\r\n");
    
    uint32_t err_code = NRF_SUCCESS;
    
    if (op_code == LWM2M_OPERATION_CODE_WRITE)
    {        
        // Remember to make a copy of lwm2m_string_t and lwm2m_opaque_t you want to keep.
        // They will be free'd after this callback.
        (void)lwm2m_tlv_server_decode(&m_instance_server, 
                                      p_request->p_payload, 
                                      p_request->payload_len);
        
        (void)lwm2m_respond_with_code(COAP_CODE_204_CHANGED, p_request);
    }
    
    return err_code;
}


/**@brief Callback function for LWM2M server objects. */
uint32_t server_object_callback(lwm2m_object_prototype_t * p_object, 
                                uint16_t                   instance_id, 
                                uint8_t                    op_code, 
                                coap_message_t *           p_request)
{
    APPL_LOG("[APPL]: lwm2m: server_object_callback\r\n");
    
    uint32_t err_code = NRF_SUCCESS;
    
    if (op_code == LWM2M_OPERATION_CODE_WRITE)
    {    
        // Remember to make a copy of lwm2m_string_t and lwm2m_opaque_t you want to keep.
        // They will be free'd after this callback.
        (void)lwm2m_tlv_server_decode(&m_instance_server, 
                                      p_request->p_payload, 
                                      p_request->payload_len);
        
        
        
        m_instance_server.proto.instance_id = instance_id;
        m_instance_server.proto.object_id   = p_object->object_id;
        m_instance_server.proto.callback    = server_instance_callback;
        
        // Cast the instance to its prototype and add it.
        // This application only supports one instance.
        (void)lwm2m_coap_handler_instance_delete((lwm2m_instance_prototype_t *)&m_instance_server);
        (void)lwm2m_coap_handler_instance_add((lwm2m_instance_prototype_t *)&m_instance_server);

        (void)lwm2m_respond_with_code(COAP_CODE_201_CREATED, p_request);
    }
    
    return err_code;
}


/**@brief Callback function for LWM2M security instances. */
uint32_t security_instance_callback(lwm2m_instance_prototype_t * p_instance, 
                                    uint16_t                     resource_id, 
                                    uint8_t                      op_code, 
                                    coap_message_t *             p_request)
{    
    APPL_LOG("[APPL]: lwm2m: security_instance_callback\r\n");
    
    if (op_code == LWM2M_OPERATION_CODE_WRITE)
    {
        uint16_t instance_id = p_instance->instance_id;
        
        // Remember to make a copy of lwm2m_string_t and lwm2m_opaque_t you want to keep.
        // They will be free'd after this callback
        uint32_t err_code = lwm2m_tlv_security_decode(&m_instance_security[instance_id], 
                                                      p_request->p_payload, 
                                                      p_request->payload_len);
        APP_ERROR_CHECK(err_code);

        // Copy the URI. Can be changed to handle all resources in the instance.
        if (m_instance_security[instance_id].server_uri.len < SECURITY_SERVER_URI_SIZE_MAX)
        {
            // Copy the lwm2m_string_t server_uri into a application allocated memory space
            // and point to that one.
            memset(m_security_server_uri[instance_id], 0, SECURITY_SERVER_URI_SIZE_MAX);

            memcpy(m_security_server_uri[instance_id],
                   m_instance_security[instance_id].server_uri.p_val,
                   m_instance_security[instance_id].server_uri.len);

            m_instance_security[instance_id].server_uri.p_val = \
                (char *)m_security_server_uri[instance_id];

            (void)lwm2m_respond_with_code(COAP_CODE_204_CHANGED, p_request);
        }
        else
        {
            // URI was to long to be copied.
            (void)lwm2m_respond_with_code(COAP_CODE_400_BAD_REQUEST, p_request);
        }
    }

    return NRF_SUCCESS;
}


/**@brief Callback function for LWM2M object instances. */
uint32_t security_object_callback(lwm2m_object_prototype_t * p_object, 
                                  uint16_t                   instance_id, 
                                  uint8_t                    op_code, 
                                  coap_message_t *           p_request)
{
    APPL_LOG("[APPL]: lwm2m: security_object_callback, instance %u\r\n", instance_id);

    if (op_code == LWM2M_OPERATION_CODE_WRITE)
    {
        // Remember to make a copy of lwm2m_string_t and lwm2m_opaque_t you want to keep.
        // They will be free'd after this callback
        uint32_t err_code = lwm2m_tlv_security_decode(&m_instance_security[instance_id], 
                                                      p_request->p_payload, 
                                                      p_request->payload_len);
        APP_ERROR_CHECK(err_code);

        m_instance_security[instance_id].proto.instance_id = instance_id;
        m_instance_security[instance_id].proto.object_id   = p_object->object_id;
        m_instance_security[instance_id].proto.callback    = security_instance_callback;

        // Copy the URI. Can be changed to handle all resources in the instance.
        if (m_instance_security[instance_id].server_uri.len < SECURITY_SERVER_URI_SIZE_MAX)
        {
            // Copy the lwm2m_string_t server_uri into a application allocated memory space
            // and point to that one.
            memset(m_security_server_uri[instance_id], 0, SECURITY_SERVER_URI_SIZE_MAX);

            memcpy(m_security_server_uri[instance_id],
                   m_instance_security[instance_id].server_uri.p_val,
                   m_instance_security[instance_id].server_uri.len);

            m_instance_security[instance_id].server_uri.p_val = \
                (char *)m_security_server_uri[instance_id];

            // Cast the instance to its prototype and add it to the coap handler to become a
            // public instance. We can only have one so we delete the first if any.
            (void)lwm2m_coap_handler_instance_delete(
                (lwm2m_instance_prototype_t *)&m_instance_security[instance_id]);

