xueliu/nRF52/nrf5_iot_sdk_3288530/examples/iot/lwm2m/lwm2m_client/main.c
            (void)lwm2m_coap_handler_instance_add(
                (lwm2m_instance_prototype_t *)&m_instance_security[instance_id]);

            (void)lwm2m_respond_with_code(COAP_CODE_201_CREATED, p_request);
        }
        else
        {
            // URI was to long to be copied.
            (void)lwm2m_respond_with_code(COAP_CODE_400_BAD_REQUEST, p_request);
        }
    }

    return NRF_SUCCESS;
}


/**@brief LWM2M initialization. 
 *
 * @details The function will register all implemented base objects as well as initial registration
 *          of existing instances. If bootstrap is not performed, the registration to the server 
 *          will use what is initialized in this function. 
 */
static void lwm2m_setup(void)
{
    (void)lwm2m_init();

    m_bootstrap_server.object_id    = LWM2M_NAMED_OBJECT;
    m_bootstrap_server.callback     = bootstrap_object_callback;
    m_bootstrap_server.p_alias_name = m_bootstrap_object_alias_name;
    (void)lwm2m_coap_handler_object_add(&m_bootstrap_server);

    // Add security support.
    m_object_security.object_id = LWM2M_OBJ_SECURITY;
    m_object_security.callback = security_object_callback;
    (void)lwm2m_coap_handler_object_add(&m_object_security);

    // Add server support.
    m_object_server.object_id = LWM2M_OBJ_SERVER;
    m_object_server.callback = server_object_callback;
    (void)lwm2m_coap_handler_object_add(&m_object_server);

    // Add digital output object support.
    m_object_digital_out.object_id = IPSO_SO_ID_DIGITAL_OUTPUT;
    (void)lwm2m_coap_handler_object_add(&m_object_digital_out);

    // Initilize the instances.
    lwm2m_instance_security_init(&m_instance_security[BOOTSTRAP_SECURITY_INSTANCE_IDX]);
    m_instance_security[BOOTSTRAP_SECURITY_INSTANCE_IDX].proto.instance_id = 0;
    
    lwm2m_instance_security_init(&m_instance_security[SERVER_SECURITY_INSTANCE_IDX]);
    m_instance_security[SERVER_SECURITY_INSTANCE_IDX].proto.instance_id = 1;
    
    lwm2m_instance_server_init(&m_instance_server);
    m_instance_server.proto.instance_id = 1;
    
    ipso_instance_digital_output_init(&m_instance_digital_out);
    m_instance_digital_out.proto.instance_id = 1;

    // Set default state.
    m_instance_digital_out.digital_output_state    = false;

    // Set default polarity.
    m_instance_digital_out.digital_output_polarity = IPSO_RR_ID_DIGITAL_OUTPUT_POLARITY_NORMAL;

    // Configure LED4 string in the IPSO instance.
    m_instance_digital_out.application_type.p_val  = m_ipso_digital_output_led4_app_type;
    m_instance_digital_out.application_type.len    = strlen(m_ipso_digital_output_led4_app_type);

    // Set callbacks.
    m_instance_digital_out.proto.callback = ipso_instance_callback;

    // Add pre-defined instances.
    (void)lwm2m_coap_handler_instance_add((lwm2m_instance_prototype_t *)&m_instance_digital_out);

    // Set client ID.
    memcpy(&m_client_id.value.uuid[0], CLIENT_UUID, LWM2M_CLIENT_ID_TYPE_UUID);
    m_client_id.type = LWM2M_CLIENT_ID_TYPE_UUID;
}


/**@brief Function for handling button events.
 *
 * @param[in]   pin_no         The pin number of the button pressed.
 * @param[in]   button_action  The action performed on button.
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    uint32_t err_code;

    if (button_action == APP_BUTTON_PUSH)
    {
        switch (pin_no)
        {
            case BUTTON_ONE:
            {
                // Bootstrap the device.
                m_bootstrapped = false;

                err_code = addr_parse_uri(m_bootstrap_remote.addr, 
                                          &m_bootstrap_remote.port_number, 
                                          &m_use_dtls[BOOTSTRAP_SECURITY_INSTANCE_IDX],
                                          m_security_server_uri[BOOTSTRAP_SECURITY_INSTANCE_IDX], 
                                          strlen(m_security_server_uri[BOOTSTRAP_SECURITY_INSTANCE_IDX]));
                APP_ERROR_CHECK(err_code);

                if (m_use_dtls[BOOTSTRAP_SECURITY_INSTANCE_IDX] == true)
                {
                    APPL_LOG("[APPL]: SECURE session (bootstrap)\r\n");
                    static char key_identity[] = "identity0";
                    static char key_secret[]   = "topsecret0";

                    static nrf_tls_preshared_key_t m_preshared_key;

                    m_preshared_key.p_identity = (uint8_t *)key_identity;
                    m_preshared_key.identity_len = strlen(key_identity);
                    m_preshared_key.p_secret_key = (uint8_t *)key_secret;
                    m_preshared_key.secret_key_len = strlen(key_secret);

                    nrf_tls_key_settings_t key_settings;
                    key_settings.p_psk = &m_preshared_key;

                    // Allocate DTLS instance.
                    err_code = coap_security_setup(BOOTSTRAP_LOCAL_PORT,
                                                   NRF_TLS_ROLE_CLIENT,
                                                   &m_bootstrap_remote,
                                                   &key_settings);
                    APP_ERROR_CHECK(err_code);
                }
                else
                {
                    APPL_LOG("[APPL]: NON-SECURE session (bootstrap)\r\n");
                }

                err_code = lwm2m_bootstrap(&m_bootstrap_remote, &m_client_id, BOOTSTRAP_LOCAL_PORT);
                if (err_code == NRF_TLS_HANDSHAKE_IN_PROGRESS)
                {
                    // Delay lwm2m bootstrapping. Try again by using iot_timer to do re-attempts.
                    m_bootstrap_retry = true;
                }
                else 
                {
                    APP_ERROR_CHECK(err_code);    
                }

                break;
            }

            case BUTTON_TWO:
            {
                // Register to the server provided during bootstrap.
                if (m_bootstrapped == true)
                {
                    err_code = addr_parse_uri(m_server_remote.addr, 
                                              &m_server_remote.port_number, 
                                              &m_use_dtls[SERVER_SECURITY_INSTANCE_IDX],
                                              m_instance_security[SERVER_SECURITY_INSTANCE_IDX].server_uri.p_val, 
                                              m_instance_security[SERVER_SECURITY_INSTANCE_IDX].server_uri.len);
                    APP_ERROR_CHECK(err_code);

