xueliu/nRF52/nrf5_iot_sdk_3288530/examples/iot/lwm2m/lwm2m_client/main.c
                    if (m_use_dtls[SERVER_SECURITY_INSTANCE_IDX] == true)
                    {
                        APPL_LOG("[APPL]: SECURE session (register)\r\n");

                        static char key_identity[] = "identity";
                        static char key_secret[]   = "topsecret";

                        static nrf_tls_preshared_key_t m_preshared_key;

                        m_preshared_key.p_identity = (uint8_t *)key_identity;
                        m_preshared_key.identity_len = strlen(key_identity);
                        m_preshared_key.p_secret_key = (uint8_t *)key_secret;
                        m_preshared_key.secret_key_len = strlen(key_secret);

                        nrf_tls_key_settings_t key_settings;
                        key_settings.p_psk = &m_preshared_key;

                        // Allocate DTLS instance.
                        err_code = coap_security_setup(SERVER_LOCAL_PORT,
                                                       NRF_TLS_ROLE_CLIENT,
                                                       &m_server_remote,
                                                       &key_settings);
                        APP_ERROR_CHECK(err_code);
                    }
                    else
                    {
                        APPL_LOG("[APPL]: NON-SECURE session (register)\r\n");
                    }

                    // Initialize server configuration structure.
                    memset(&m_server_conf, 0, sizeof(lwm2m_server_config_t));
                    m_server_conf.lifetime = 1000;
                    
                    // Dry run the link format generation, to check how much memory that is needed.
                    err_code = lwm2m_coap_handler_gen_link_format(NULL, (uint16_t *)&m_link_format_string_len);
                    APP_ERROR_CHECK(err_code);
                    
                    // Allocate the needed amount of memory.
                    err_code = nrf_mem_reserve(&mp_link_format_string, &m_link_format_string_len);
                    APP_ERROR_CHECK(err_code);
                    
                    // Render the link format string.
                    err_code = lwm2m_coap_handler_gen_link_format(mp_link_format_string, (uint16_t *)&m_link_format_string_len);
                    APP_ERROR_CHECK(err_code);
                    
                    err_code = lwm2m_register(&m_server_remote, 
                                              &m_client_id, 
                                              &m_server_conf, 
                                              SERVER_LOCAL_PORT, 
                                              mp_link_format_string, 
                                              (uint16_t)m_link_format_string_len);
                    if (err_code == NRF_TLS_HANDSHAKE_IN_PROGRESS)
                    {
                        // Delay lwm2m server registration. Try again by using iot_timer to do re-attempts.
                        m_register_retry = true;
                    }
                    else 
                    {
                        APP_ERROR_CHECK(err_code);    
                    }
                }

                break;
            }
            
            case BUTTON_THREE:
            {
                // Destroy the secure session if any.
                if (m_bootstrapped == true)
                {
                    if (m_use_dtls[BOOTSTRAP_SECURITY_INSTANCE_IDX] == true)
                    {
                        err_code = coap_security_destroy(BOOTSTRAP_LOCAL_PORT, &m_bootstrap_remote);
                        APP_ERROR_CHECK(err_code);
                    }

                    if (m_use_dtls[SERVER_SECURITY_INSTANCE_IDX] == true)
                    {
                        err_code = coap_security_destroy(SERVER_LOCAL_PORT, &m_server_remote);
                        APP_ERROR_CHECK(err_code);
                    }
                }
                break;
            }

#ifdef COMMISSIONING_ENABLED
            case ERASE_BUTTON_PIN_NO:
            {
                APPL_LOG("[APPL]: Erasing all commissioning settings from persistent storage... \r\n");
                commissioning_settings_clear();

                break;
            }
#endif // COMMISSIONING_ENABLED

            default:
                break;
        }
    }
}


/**@brief Function for the Button initialization.
 *
 * @details Initializes all Buttons used by this application.
 */
static void buttons_init(void)
{
    uint32_t err_code;

    static app_button_cfg_t buttons[] =
    {
        {BUTTON_ONE,          false, BUTTON_PULL, button_event_handler},
        {BUTTON_TWO,          false, BUTTON_PULL, button_event_handler},
        {BUTTON_THREE,        false, BUTTON_PULL, button_event_handler},
#ifdef COMMISSIONING_ENABLED
        {ERASE_BUTTON_PIN_NO, false, BUTTON_PULL, button_event_handler}
#endif // COMMISSIONING_ENABLED
    };

    err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]), 
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);

    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting connectable mode.
 */
static void connectable_mode_enter(void)
{
    uint32_t err_code = ipv6_medium_connectable_mode_enter(m_ipv6_medium.ipv6_medium_instance_id);
    APP_ERROR_CHECK(err_code);

    APPL_LOG("[APPL]: Physical layer in connectable mode.\r\n");
    m_display_state = LEDS_CONNECTABLE_MODE;
}


static void on_ipv6_medium_evt(ipv6_medium_evt_t * p_ipv6_medium_evt)
{
    switch (p_ipv6_medium_evt->ipv6_medium_evt_id)
    {
        case IPV6_MEDIUM_EVT_CONN_UP:
        {
            APPL_LOG("[APPL]: Physical layer: connected.\r\n");
            m_display_state = LEDS_IPV6_IF_DOWN;
            break;
        }
        case IPV6_MEDIUM_EVT_CONN_DOWN:
        {
            APPL_LOG("[APPL]: Physical layer: disconnected.\r\n");
            connectable_mode_enter();
            break;
        }
        default:
        {
            break;
        }
    }
}


static void on_ipv6_medium_error(ipv6_medium_error_t * p_ipv6_medium_error)
{
    // Do something.
}


